notes/radical-minimalist-web-design.org
#+title: 激进极简主义网页设计
#+date: <2026-02-02 Mon>
#+filetags: :web:minimalism:philosophy:
#+SETUPFILE: ~/niwa/template/setup/minimal.setup
#+EXPORT_FILE_NAME: ~/niwa/public/radical-minimalist-web-design.html

** 极简主义
极简主义（英语：Minimalism），是第二次世界大战之后的 1960 年代所兴起的一个艺术派系，又可称为“Minimal Art”，作为对抽象表现主义的反动而走向极致，以最原初的物自身或形式展示于观者面前为表现方式，意图消弥作者借着作品对观者意识的压迫性，极少化作品作为文本或符号形式出现时的暴力感，开放作品自身在艺术概念上的意像空间，让观者自主参与对作品的建构，最终成为作品在不特定限制下的作者。

** 激进极简主义网页设计
*** 纯静态
作为由个人撰写的博客、资料、笔记展示页面，不需要任何后端代码，以内容为核心，保持简单、轻量、可维护。读者不需要在这个页面上有任何互动，唯一需要的就是用眼睛阅读文字。
*** 仅必要的 CSS 且无 JS
由于读者只需要做一件事：阅读，所以这个页面不需要任何花里胡哨的装饰，包括但不限于：鼠标指针、艺术字体、背景图片。也不需要任何表单交互、以及弹窗广告、悬浮广告，并且引入 Javascript 代码会带来网页的性能问题，哪怕加载慢了 0.01ms。
*** 以文字为中心
言简意赅地阐述观点，尽可能减少图片出现的比重，对服务器带宽和读者的流量都友好。
*** 其他
我见过不少「功能丰富」的博客站点，比如 Live2D 看板娘、音乐播放器、天气时间显示、读完一篇文章还没加载出来的开屏图……我认为这和信息的传播 *完全没有任何关系* 。当然，适当的装饰是锦上添花，但 *别太过了* 。

这个网站就是把简单做到极致的尝试，也许在不少人眼中看来这是「简陋」「低技术力」的表现，但要先弄清楚一个站点是在为什么而服务。

** 参考
- [[https://zh.wikipedia.org/zh-cn/%E6%A5%B5%E7%B0%A1%E4%B8%BB%E7%BE%A9][极简主义 - 维基百科]]
- [[https://motherfuckingwebsite.com/][motherfuck website]]
